src/cf/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПриходныйДокументПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ДвиженияСвязанныхДокументов/ДвиженияСвязанныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияСвязанныхДокументов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>DefinedType.КодСтроки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/РеализацияТоваровУслуг/Forms/ФормаВыбораРозница/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Если Параметры.Свойство("Контрагент") Тогда 
		Контрагент = Параметры.Контрагент;
	КонецЕсли;
	МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
	Если Параметры.Свойство("МестоХранения") Тогда 
		МестоХранения = Параметры.МестоХранения;
	КонецЕсли;
	Операция = Перечисления.ХозяйственныеОперации.ПустаяСсылка();
	Если Параметры.Свойство("Операция") Тогда 
		Операция = Параметры.Операция;
	КонецЕсли;
	ТолькоНеоплаченные = Ложь;
	Если Параметры.Свойство("ТолькоНеоплаченные") Тогда 
		ТолькоНеоплаченные = Параметры.ТолькоНеоплаченные;
	КонецЕсли;
	МасТовары = Новый Массив;
	Если Параметры.Свойство("МасТовары") Тогда 
		МасТовары = Параметры.МасТовары;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Контрагент);
	Список.Параметры.УстановитьЗначениеПараметра("МестоХранения",МестоХранения);
	Список.Параметры.УстановитьЗначениеПараметра("Операция",Операция);
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоНеоплаченные",ТолькоНеоплаченные);
	Список.Параметры.УстановитьЗначениеПараметра("МасТовары",МасТовары);
	Список.Параметры.УстановитьЗначениеПараметра("ЕстьТовары",Не МасТовары.Количество() = 0);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтр = Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		Закрыть(Новый Структура("Документ,Сумма,СуммаОстаток",ТекСтр.Ссылка, ТекСтр.Сумма, ТекСтр.СуммаОстаток));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтр = Неопределено Тогда 
		СтандартнаяОбработка = Ложь;
		Закрыть(Новый Структура("Документ,Сумма,СуммаОстаток",ТекСтр.Ссылка, ТекСтр.Сумма, ТекСтр.СуммаОстаток));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтр = Элементы.Список.ТекущиеДанные;
	Если ТекСтр = Неопределено Тогда 
		ТЗТовары.Очистить();
		Возврат;
	КонецЕсли;
	ЗаполнитьТовары(ТекСтр.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары(Док) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ТЧТоварыРеализация = Док.ТЧТовары.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(&ДокРеализация КАК Документ.РеализацияТоваровУслуг) КАК Ссылка,
	|	ТЧТоварыРеализация.Номенклатура КАК Номенклатура,
	|	ТЧТоварыРеализация.Характеристика КАК Характеристика,
	|	ТЧТоварыРеализация.Серия КАК Серия,
	|	ТЧТоварыРеализация.Цена КАК Цена,
	|	ТЧТоварыРеализация.Сумма КАК Сумма,
	|	ТЧТоварыРеализация.Количество КАК Количество
	|ПОМЕСТИТЬ ТЧТоварыРеализация
	|ИЗ
	|	&ТЧТоварыРеализация КАК ТЧТоварыРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЗ.Номенклатура КАК Номенклатура,
	|	ВЗ.Характеристика КАК Характеристика,
	|	ВЗ.Серия КАК Серия,
	|	СУММА(ВЗ.Сумма) КАК Сумма,
	|	СУММА(ВЗ.Количество) КАК Количество,
	|	ВЗ.ВидОперации КАК ВидОперации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТЧТоварыРеализация.Номенклатура КАК Номенклатура,
	|		ТЧТоварыРеализация.Характеристика КАК Характеристика,
	|		ТЧТоварыРеализация.Серия КАК Серия,
	|		ТЧТоварыРеализация.Сумма КАК Сумма,
	|		ТЧТоварыРеализация.Количество КАК Количество,
	|		ТЧТоварыРеализация.Ссылка.ХозяйственнаяОперация КАК ВидОперации
	|	ИЗ
	|		ТЧТоварыРеализация КАК ТЧТоварыРеализация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияСвязанныхДокументов.Номенклатура,
	|		ДвиженияСвязанныхДокументов.Характеристика,
	|		ДвиженияСвязанныхДокументов.Серия,
	|		ДвиженияСвязанныхДокументов.СуммаОборот,
	|		ДвиженияСвязанныхДокументов.КоличествоОборот,
	|		ДвиженияСвязанныхДокументов.Регистратор.ХозяйственнаяОперация
	|	ИЗ
	|		РегистрНакопления.ДвиженияСвязанныхДокументов.Обороты(, , Регистратор, Основание = &ДокРеализация) КАК ДвиженияСвязанныхДокументов
	|	ГДЕ
	|		НЕ ДвиженияСвязанныхДокументов.Регистратор = &Регистратор) КАК ВЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЗ.Характеристика,
	|	ВЗ.Номенклатура,
	|	ВЗ.Серия,
	|	ВЗ.ВидОперации";
	Запрос.УстановитьПараметр("ТЧТоварыРеализация",ТЧТоварыРеализация);
	Запрос.УстановитьПараметр("ДокРеализация",Док);
	Запрос.УстановитьПараметр("Регистратор",Док.Ссылка);
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	// Удалим нулевые
	Мас = ТЗРезультат.НайтиСтроки(Новый Структура("Количество", 0));
	Для А = 1 - Мас.Количество() По 0 Цикл
		ТЗРезультат.Удалить(Мас[-А]);	
	КонецЦикла;
	ТЗТовары.Загрузить(ТЗРезультат);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		Попытка 
			УИ = Новый УникальныйИдентификатор(Штрихкод);
			Док = ПолучитьДокументНаСЕрвере(УИ);
			Если ЗначениеЗаполнено(Док) Тогда
				Элементы.Список.ТекущаяСтрока = Док;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументНаСЕрвере(УИ)
	Возврат Документы.РеализацияТоваровУслуг.ПолучитьСсылку(УИ);
КонецФункции
